# -*- coding: utf-8 -*-
import os

from airtest.core.cv import Template

from Utils.LoadConfig import LoadConfig
from Utils.OtherTools import OT


class GlobalEnumG:
    if not os.path.exists(OT.abspath(f"/Res/配置文件.ini")):
        LoadConfig.init_config()
    Ver = '2.0'
    GamePackgeName = r'com.nexon.maplem.global'
    FindImgTimeOut = 20  # 查找图片等待超时时间
    TouchDurationTime = 4  # 延时点击
    LoginGameTimeOut = 600  # 登录超时时长
    UiCheckTimeOut = 600  # 界面操作超时时长
    SelectCtrTimeOut = 150  # 操作超时时长
    TouchWaitTime = 2  # 点击后等待时长

    PWD_POS = {
        '0': (805, 478),
        '1': (515, 523),
        '2': (608, 508),
        '3': (674, 515),
        '4': (514, 434),
        '5': (610, 433),
        '6': (710, 437),
        '7': (513, 347),
        '8': (613, 339),
        '9': (663, 324)
    }

    JN_POS = {
        0: (378, 372),
        1: (251, 415),
        2: (248, 298),
        3: (330, 235),
        4: (451, 233)
    }
    TasKId = {

    }
    ZhiYe = {
        "长按技能": "0",
        "短按": "1"
    }
    StatesInfo = {
        'InGame': {'name': "游戏中", 'id': 1},
        'Nothing': {'name': "无任务", 'id': 2},
        'Wait': {'name': "等待任务", 'id': 2},
        'Login': {'name': "登录游戏", 'id': 2},
        'Check': {'name': "检查界面", 'id': -1},
        'BuyY': {'name': "买药", 'id': 4},
        'FuHuo': {'name': "复活", 'id': 3},
        'BagSell': {'name': "背包出售", 'id': 5},
        'BagClear':{'name':"背包清理",'id':5},
        'UpEquip': {'name': "升级装备", 'id': 8},
        'StrongEquip': {'name': "强化装备", 'id': 8},
        'LearnSkill': {'name': "学习技能", 'id': 8},
        'UseSkill': {'name': "摆放技能", 'id': 8},
        'UsePet': {'name': "摆放宠物", 'id': 8},
        'GetReward': {'name': "领取奖励", 'id': 8},
        'CheckXT': {'name': "星图检查", 'id': 8},
        'CheckYT': {'name': "野图检查", 'id': 8},
        'AutoTask': {'name': "自动任务", 'id': 1},
        'AutoMR': {'name': "自动每日", 'id': 2},
        'AutoBat': {'name': "自动挂机", 'id': 3},
        'AutoBoss': {'name': "混BOSS图", 'id': 2},
        'AutoHDboss': {'name': '混沌boss', 'id': 2},
        'CheckRole': {'name': "检查角色", 'id': 5},
        'GetLevelReard': {'name': "领取成长奖励", 'id': 5},
        'CheckGold': {'name': "计算产出", 'id': 6}
    }
    ExecuteStates = ['AutoTask', 'AutoBat', 'Nothing', 'Wait']
    SelectStates = ['InGame',
                    'Check',
                    'Login',
                    'FuHuo',
                    'BuyY',
                    'BagSell',
                    'BagClear',
                    'UseSkill',
                    'UsePet',
                    'UpEquip',
                    'StrongEquip',
                    'GetReward',
                    'CheckXT',
                    'CheckYT',
                    'AutoBoss',
                    'AutoHDboss',
                    'AutoMR',
                    'CheckRole',
                    'GetLevelReard',
                    'CheckGold', ]


class ImgEnumG:
    """图片数据"""
    TEST = Template(OT.imgpath('21'))
    # UI_CLOSE = [(571, 39, 711, 76), Template(OT.imgpath('关闭界面'))]
    UI_CLOSE = [(1060, 24, 1149, 97), Template(OT.imgpath('弹窗'))]
    UI_QR = [(0, 0, 1280, 720), Template(OT.imgpath('确认'))]
    UI_QBLQ = [(0, 0, 1280, 720), Template(OT.imgpath('全部领取'))]
    UI_GM = [(0, 0, 1280, 720), Template(OT.imgpath('购买'))]
    UI_YES = [(277, 92, 989, 637), Template(OT.imgpath('是'))]
    UI_NO = [(277, 92, 989, 637), Template(OT.imgpath('否'))]
    UI_LB = [(1132, 58, 1157, 86), Template(OT.imgpath('推荐礼包'))]
    UI_SET = [(1196, 626, 1278, 708), Template(OT.imgpath('设置'))]
    TIP_ClOSE = [(831, 373, 870, 415), Template(OT.imgpath('提示'))]
    GAME_END = [(567, 151, 709, 198), '结束']  # 游戏结束
    NET_ERR = [(493, 365, 778, 387), '不佳']  # 网络异常
    # 下载更新
    GAME_XZ = [(562, 148, 721, 202), '下']  # 下载警告
    # 活动
    QD = [(956, 631, 1249, 697), Template(OT.imgpath('活动签到'))]
    QD_LQ = [(951, 624, 1264, 703), Template(OT.imgpath('签到奖励'))]
    QD_1 = [(1218, 12, 1265, 55), Template(OT.imgpath('活动签到1'))]
    # 登录相关
    GAME_ICON = [(0, 0, 1280, 720), Template(OT.imgpath('游戏icon'))]
    LOGIN_FLAG = [(1014, 538, 1271, 703), Template(OT.imgpath('游戏登陆标志'))]
    LOGIN_FLAG1 = [(20, 665, 56, 701), Template(OT.imgpath('登录区域'))]  # 20,665,56,701
    START_GAME = [(963, 481, 1278, 688), Template(OT.imgpath('游戏开始'))]  # 963,481,1278,688
    INGAME_FLAG = [(734, 9, 1253, 64), Template(OT.imgpath('验证登录标记'))]  # 734,9,1253,64
    INGAME_FLAG2 = [(904, 336, 939, 372), Template(OT.imgpath('验证登录标记2'))]
    LOGIN_TIPS = [(1240, 14, 1264, 61), Template(OT.imgpath('登录弹窗'))]
    # 任务相关
    SKIP_OCR = [(1172, 17, 1224, 41), '略']  # 略过
    TASK_ZDFP = [(752, 340, 835, 361), '分']
    JN_ZDFP = [(498, 391, 590, 419), '分']  # 技能自动分配
    TASK_ZB = [(748, 380, 794, 406), '装']  # 任务弹出装备按钮
    ZB_TS = [(738, 236, 1264, 646), Template(OT.imgpath('装备提升'))]  # 装备上绿色小箭头
    ZB_ZB = [(1146, 630, 1207, 660), '装']  # 装备详情-装备
    TASK_CLOSE = [(1198, 31, 1250, 82), Template(OT.imgpath('任务界面'))]
    TASK_TAB = [(0, 0, 1280, 720), Template(OT.imgpath('任务页签'), rgb=True)]
    TASK_POINT = [(69, 181, 119, 403), Template(OT.imgpath('任务点'))]
    TASK_START = [(341, 529, 482, 715), Template(OT.imgpath('任务可开始'))]
    TASK_ARROW = [(1189, 483, 1236, 522), Template(OT.imgpath('任务箭头'))]
    TASK_TAKE = [(1067, 403, 1150, 438), Template(OT.imgpath('任务接受'))]
    TASK_OVER = [(0, 0, 1280, 720), Template(OT.imgpath('任务完成'))]
    TASK_MR_QR = [(0, 0, 1280, 720), Template(OT.imgpath('每日任务确认'))]
    TASK_REWARD = [(595, 630, 685, 659), Template(OT.imgpath('任务奖励'))]
    MOVE_NOW = [(752, 191, 825, 214), Template(OT.imgpath('立刻移动'))]
    # 每日相关
    MR_MENU = [(1225, 25, 1252, 52), Template(OT.imgpath('菜单'))]
    # 活动
    HD_QBLQ = [(698, 628, 807, 661), Template(OT.imgpath('全部领取'), rgb=True)]
    HD_QBLQ2 = [(1124, 645, 1222, 684), Template(OT.imgpath('全部领取2'), rgb=True)]
    KT_QBLQ = [(1138, 650, 1223, 680), Template(OT.imgpath('课题全部领取'))]
    KT_QBLQ2 = [(1133, 645, 1226, 684), Template(OT.imgpath('课题全部领取2'), rgb=True)]
    KT_QBLQ3 = [(1132, 642, 1229, 690), Template(OT.imgpath('课题全部领取3'), rgb=True)]
    HD_XX = [(554, 603, 654, 632), Template(OT.imgpath('休息奖励领取'))]
    HD_CZZY = [(549, 96, 952, 158), '全部的成']  # 全部的成長支拨
    CZZY = [(28, 125, 468, 178), Template(OT.imgpath('成长奖励'))]
    # 背包清理
    BAG_FULL = [(1140, 36, 1195, 64), 'FULL']  # 背包满
    BAG_SELL = [(1167, 663, 1215, 687), Template(OT.imgpath('贩售'))]
    BAG_FJ = [(1026, 661, 1071, 688), Template(OT.imgpath('分解'))]
    BAG_CS_LIST = [(644, 110, 697, 579), Template(OT.imgpath('出售1'))]
    BAG_SX = [(52, 657, 90, 691), Template(OT.imgpath('筛选'))]
    BAG_SX_TY = [(762, 622, 818, 64), Template(OT.imgpath('套用'))]
    BAG_CS_QR = [(1145, 660, 1193, 688), Template(OT.imgpath('贩售确认'), rgb=True)]
    BAG_CS_QR1 = [(758, 519, 818, 547), Template(OT.imgpath('贩售确认1'))]
    BAG_GOLD = [(917, 4, 1134, 82), Template(OT.imgpath('金币详情'))]
    # 邮件
    MAIL_RQ = [(972, 27, 1006, 49), Template(OT.imgpath('邮件'))]
    MAIL_NULL = [(583, 315, 701, 408), Template(OT.imgpath('无邮件'))]
    # 战斗相关
    XC_OCR = [(1040, 598, 1107, 634), '除']  # 卸除 骑宠没下
    TC_XX = [(492, 276, 780, 298), '除休息玩家']  # 踢出休息警告
    AUTO_JG = [(539, 154, 742, 198), '结果']  # 自动战斗结果
    AUTO_BAT_OCR = [(395, 647, 450, 663), '自']  # 自动战斗未开启
    AUTO_UI_OCR = [(572, 111, 711, 151), '自']  # 自动战斗界面
    S_MAP = [(1190, 70, 1272, 140), Template(OT.imgpath('小地图'))]
    PERSON_POS = [(864, 75, 1257, 193), Template(OT.imgpath('人物坐标'))]
    XT_MOVE = [(1133, 648, 1193, 677), Template(OT.imgpath('星图移动'))]
    # 组队相关
    TEMA_ING = [(332, 245, 410, 332), Template(OT.imgpath('组队中'))]
    TEAM_CREAT = [(78, 197, 217, 381), Template(OT.imgpath('创立队伍'))]
    TEAM_AUTO_JION = [(78, 197, 217, 381), Template(OT.imgpath('自动加入'))]
    TEAM_FIND = [(78, 197, 217, 381), Template(OT.imgpath('自动加入'))]
    # 装备
    EQ_JJS = [(734, 155, 1268, 645), Template(OT.imgpath('凝聚力量的结晶石'))]
    EQ_TJP_OCR = [(802, 75, 1259, 623), '匠铺']  # 铁匠铺
    EQ_UP_OCR = [(37, 304, 135, 363), '升']  # 升级
    EQ_QH_OCR = [(158, 316, 248, 350), '星力']  # 星力强化
    EQ_ZBZ_OCR = [(730, 166, 1265, 616), '装']  # 装备中
    EQ_WZB = [(225, 97, 370, 211), Template(OT.imgpath('无装备'))]
    EQ_ZDXZ = [(1002, 597, 1279, 717), Template(OT.imgpath('自动选择'))]
    EQ_ZDXZ_UI_OCR = [(571, 38, 713, 81), '自']  # 自动选择
    EQ_ZDXZ_SD_OCR = [(59, 502, 513, 524), '定']  # 存储自动选择设定
    EQ_UP = [(559, 621, 717, 701), Template(OT.imgpath('升级'), rgb=True)]  # 升级确认按钮
    EQ_UP_QR = [(492, 604, 789, 682), Template(OT.imgpath('升级确认'))]
    # 强化
    EQ_QH_NULL = [(413, 210, 465, 232), '基']  # 强化格子为空
    EQ_QH = [(606, 647, 664, 679), Template(OT.imgpath('强化'))]
    EQ_QH2 = [(603, 536, 678, 564), Template(OT.imgpath('强化2'))]
    # 买药
    CZ_FUHUO = [(267, 472, 525, 585), Template(OT.imgpath('复活'))]
    BUY_NOW_MOVE = [(792, 162, 914, 685), Template(OT.imgpath('立即前往'))]
    BUY_YS_LOGIN = [(792, 162, 914, 685), Template(OT.imgpath('药水登录'))]
    JN_LOGIN_2 = [(790, 305, 912, 382), Template(OT.imgpath('药水登录'))]
    BUY_YS_NUM = [(909, 628, 947, 665), Template(OT.imgpath('药品数量'))]
    HP_NULL_OCR = [(1116, 368, 1184, 387), 'HP']  # HP为空
    MP_NULL_OCR = [(1194, 370, 1263, 388), 'MP']
    YS_GM_QR = [(577, 157, 704, 196), '道具']  # 购买确认
    YS_NUM_OCR = {
        '5': [(733, 631, 810, 658), '500'],
        '4': [(733, 631, 810, 658), '400'],
        '3': [(733, 631, 810, 658), '300'],
        '2': [(733, 631, 810, 658), '200'],
        '0': [(733, 631, 810, 658), '100'],
    }
    YS_LEVEL = {
        '4阶药水': (759, 253),
        '5阶药水': (1025, 235),
        '6阶药水': (1210, 244),
        '7阶药水': (318, 445),
        '8阶药水': (490, 448),
        '9阶药水': (594, 445)
    }
    YS_NUM = {
        '0': (1024, 517),
        '1': (739, 317),
        '2': (839, 317),
        '3': (939, 317),
        '4': (739, 417),
        '5': (839, 417),
        '6': (939, 417),
        '7': (739, 517),
        '8': (839, 517),
        '9': (939, 517),
    }

    # 买药
    BUY_MP_LOGIN = [(549, 33, 730, 74), '水']  # 登绿MP樂水
    BUY_HP_LOGIN = [(549, 33, 730, 74), '登绿HP樂水']  # 登绿HP樂水
    YS_GM = [(664, 209, 772, 237), '水']  # 药水购买界面
    # Ocr
    TASK_OCR = [(395, 647, 450, 663), '任']  # 自动任务
    BAG_OCR = [(9, 18, 94, 61), '背包']  # 背包
    BAG_CS_OCR = [(13, 18, 92, 61), '贩售']  # 贩售
    BAG_SX_OCR = [(571, 39, 711, 76), '贾']  # 贩卖筛选
    BAG_CS_QR_OCR = [(575, 154, 707, 197), '贩售道具']  # 贩售道具
    BAG_GOLD_OCR = [(574, 155, 705, 195), '持有']  # 持有枫币
    # 清理背包
    RED_BS = [(738, 161, 1266, 644), Template(OT.imgpath('红宝石'))]
    G_BS = [(738, 161, 1266, 644), Template(OT.imgpath('绿宝石A'))]
    Z_BS = [(738, 161, 1266, 644), Template(OT.imgpath('紫宝石A'))]
    L_BS = [(738, 161, 1266, 644), Template(OT.imgpath('蓝宝石A'))]
    JZT_DJ = [(738, 161, 1266, 644), Template(OT.imgpath('金字塔产物'))]
    FJ_HE1 = [(738, 161, 1266, 644), Template(OT.imgpath('防具合成石1'))]
    FJ_HE2 = [(738, 161, 1266, 644), Template(OT.imgpath('防具合成石2'))]
    WQ_HE1 = [(738, 161, 1266, 644), Template(OT.imgpath('武器合成石1'))]
    WQ_HE2 = [(738, 161, 1266, 644), Template(OT.imgpath('武器合成石2'))]
    BAG_BS = [(664, 209, 780, 235), '珠']
    BAG_DQ = [(771, 626, 848, 663), '丢']
    BAG_DQ1 = [(702, 624, 764, 662), '丢']
    BAG_DQ_QR = [(571, 155, 712, 201), '丢']
    BAG_NULL = [(738, 161, 1266, 644), Template(OT.imgpath('空格子'))]
    # 技能
    MENU_JN = [(798, 73, 1265, 618), '技能']
    JN_ZB_OCR = [(976, 171, 1125, 698), '装']
    JN_XZ = [(172, 164, 507, 476), Template(OT.imgpath('卸载技能'), threshold=0.9)]
    JN_ZB = [(976, 171, 1125, 698), Template(OT.imgpath('装备技能'), rgb=True)]
    # 宠物
    CW_SJJS = [(516, 85, 771, 127), '物剩']  # 宠物剩余时间结束
    MENU_CW = [(798, 73, 1265, 618), '窜物']
    CW_NULL = [(479, 140, 521, 160), 'ACC']  # 未装备宠物
    USE_CW = [(1146, 628, 1203, 661), '装']
    FEVER = [(201, 505, 254, 543), 'Fever']  # 宠物技能
    JN_LOGIN = [(573, 34, 705, 73), '技能登']  # 技能登录
    PET_1 = [(349, 143, 433, 217), Template(OT.imgpath('默认宠物1'))]
    PET_2 = [(349, 143, 433, 217), Template(OT.imgpath('默认宠物2'))]
    CW_TYPE = {
        'A': [[(735, 163, 1268, 651), Template(OT.imgpath('宠物A1'))],
              [(735, 163, 1268, 651), Template(OT.imgpath('宠物A2'))],
              [(735, 163, 1268, 651), Template(OT.imgpath('宠物A3'))]],
        'B': [[(735, 163, 1268, 651), Template(OT.imgpath('宠物B1'))],
              [(735, 163, 1268, 651), Template(OT.imgpath('宠物B2'))],
              [(735, 163, 1268, 651), Template(OT.imgpath('宠物B3'))]],
        'C': [[(735, 163, 1268, 651), Template(OT.imgpath('宠物C1'))],
              [(735, 163, 1268, 651), Template(OT.imgpath('宠物C2'))],
              [(735, 163, 1268, 651), Template(OT.imgpath('宠物C3'))]]
    }
    PET_POS = {
        1: [131, 130, '2B3747', 'EE7546'],
        2: [127, 219, '2B3747', 'EE7546'],
        3: [127, 306, '2B3747', 'EE7546']
    }

    # BOSS
    YM_READY = [(109, 147, 230, 183), 'Y']
    PKJ_READY = [(757, 152, 855, 179), 'Y']
    NH_READY = [(1071, 151, 1178, 181), 'Y']
    YM_OVER = [(122, 135, 205, 163), 'C']
    PKJ_OVER = [(750, 138, 862, 169), 'C']
    NH_OVER = [(1029, 111, 1208, 184), 'C']
    BOSS_DJ = [(571, 32, 693, 65), '现道']
    # 每日
    MR_BACK = [(23, 22, 66, 61), Template(OT.imgpath('返回'))]
    MR_BAT_EXIT = [(1202, 251, 1269, 317), Template(OT.imgpath('战斗退出'), threshold=0.8)]
    MR_TIP_CLOSE = [(1209, 12, 1276, 73), Template(OT.imgpath('关闭界面'), threshold=0.8)]  # 关闭菜单界面弹窗
    MR_MENU_KSNR = [(809, 73, 1250, 608), '快速内容']  # 菜单入口
    MR_KSZD = [(1060, 639, 1174, 685), '快速']  # 快速粗际
    MR_AREA = (5, 151, 1271, 712)
    HD_MENU = [(809, 73, 1250, 608), '活勤']
    MR_GWGY_OCR = [(9, 7, 314, 73), '怪物公']  # 怪物公园
    GWGY_FQ = [(357, 491, 445, 553), '放']
    MR_XLZC_OCR = [(9, 7, 314, 73), '星力']  # 星力戟场
    XT_FLAG = [(191, 83, 297, 117), Template(OT.imgpath('星图标记'))]
    XT_MOVE_QR = [(534, 154, 738, 194), '星力']  # 移勤星力戟堤

    MR_JZT_OCR = [(9, 7, 314, 73), '金字塔']  # 奈特的金字塔
    MR_XZD_OCR = [(9, 7, 314, 73), '征']  # 速征际
    MR_GWSLT_OCR = [(9, 7, 314, 73), '怪物狩']  # 怪物狩僧惠
    GWSLT_ZDJL = [(570, 39, 708, 83), '纪']  # 战斗记录
    GWSLT_ZDJS = [(398, 296, 860, 348), '结束']  # 战斗结束 游咸重元结束!2秒俊自勤退出
    MR_MRDC_OCR = [(9, 7, 314, 73), '每日']  # 每日地城
    MR_JYDC_OCR = [(9, 7, 314, 73), '菁英']  # 菁英地城
    MR_MNDC_OCR = [(9, 7, 314, 73), '迷你']  # 迷你地城
    MNDC_JR = [(540, 140, 740, 185), '入迷你地城']  # 进入迷你地城
    MNDC_JS = [(533, 126, 747, 174), '结束迷你地城']
    MNDC_JG = [(576, 79, 705, 118), '结果']  # 最终结果
    MNDC_JSQR = [(747, 543, 819, 573), '结束']
    MNDC_FQ = [(463, 530, 535, 567), '放']  # 放弃之前的地城
    MR_GHDC_OCR = [(99, 19, 250, 63), '公曾']  # 公会地城
    MR_GH_OCR = [(11, 13, 92, 65), '公曾']  # 公会主界面
    JRGH_OCR = [(569, 406, 708, 448), '加入公']  # 加入公会
    MR_JRGH_OCR = [(99, 19, 178, 66), '公']  # 加入公会
    GH_KSJR = [(653, 667, 736, 698), '快速加入']
    GH_WXDC = [(1121, 362, 1240, 386), '限']  # 无限地城
    MR_RYZ_OCR = [(97, 18, 274, 63), '誉']  # 公会荣誉战
    GH_WXDC_MAP = [(40, 90, 132, 117), '塔']  # 无限地城战斗中
    GH_RYZ = [(1129, 465, 1238, 496), '荣誉']  # 公会荣誉战
    MR_WLDC_OCR = [(9, 7, 314, 73), '武陵道']  # 武陵道堤
    MR_WLDC_PM = [(515, 38, 766, 77), '排名']  # 排名结算
    ZD_KS = [(350, 380, 390, 401), '始']  # 组队 开始
    MR_WLDC_RC = [(1065, 637, 1177, 676), Template(OT.imgpath('入场'), threshold=0.9)]
    MR_WLDC_JR = [(584, 43, 698, 95), '入']  # 进入界面
    MR_JZT_JR = [(593, 153, 682, 193), '入']  # 进入界面
    MR_MRDC_JR = [(601, 39, 680, 81), '入']  # 进入界面
    MR_YDZXD = [(311, 487, 960, 660), '移勤至']  # 移勤至遐革
    MR_MAX = [(984, 249, 1029, 273), Template(OT.imgpath('MAX'))]
    MR_JHXT_OCR = [(9, 7, 314, 73), '化系']  # 淮化系流
    MR_TBB_OCR = [(9, 7, 314, 73), '寳寳的']  # 温寳寳的料
    TBB_CLGW = [(540, 39, 739, 82), '材料怪物']
    TBB_ZDJS = [(588, 525, 701, 561), '碓']  # 确认
    TBB_ZCTZ = [(784, 629, 891, 660), '再次']
    TBB_ZCRC = [(570, 36, 708, 75), '再次入']  # 再次入场
    TBB_QX = [(450, 628, 531, 660), '取消']  # 取消再次入场
    MR_XGT_OCR = [(9, 7, 314, 73), '星光M塔']  # 星光M塔
    MR_XGT_JR = [(550, 156, 739, 194), '星光M塔']
    MR_HD_OCR = [(9, 7, 314, 73), '混沌速']  # 混沌速征际
    YZD_JS = [(464, 324, 804, 362), '退出']  # 远征队结束
    MR_CYRQ_OCR = [(9, 7, 314, 73), '次元入侵']  # 次元入侵
    # ------
    KT_MENU = [(809, 73, 1250, 608), '课题']

    HD_UI_OCR = [(5, 5, 175, 73), '活勤']  # 活勤
    KT_UI_OCR = [(5, 5, 175, 73), '课题']  # 课题 界面
    JN_UI_OCR = [(5, 5, 175, 73), '技能']  # 技能 界面
    CW_UI_OCR = [(5, 5, 175, 73), '窜物']  # 宠物 界面
    SD_UI_OCR = [(5, 5, 175, 73), '商店']  # 商店 界面
    MR_UI_OCR = [(5, 5, 175, 73), '快速']  # 快速单元 界面
    TJP_UI_OCR = [(5, 5, 175, 73), '匠']  # 藏匠铺 铁匠铺
    MAP_UI_OCR = [(18, 10, 122, 66), '地']  # 地圆 地图
    MAP_MOVE_ERR = [(546, 152, 736, 199), '法瞬']  # 无法瞬间移动
    MAP_DONT_USE = [(576, 152, 707, 201), '法使用']  # 没石头无法使用
    MAP_MOVE_END = [(546, 152, 736, 199), '完成']  # 瞬间移动完成
    MAP_XL = [(592, 310, 665, 339), '目的地']  # 寻路确认框
    MAP_MOVE_NOW = [(530, 280, 677, 308), '移之石']  # 确认瞬间移动
    MAP_XL_OCR = [(495, 188, 583, 217), '接移']  # 寻路中
    MAP_YD = [(938, 648, 1037, 678), '移']  # 瞬间移动按钮

    KT_MRRW_OCR = [(42, 75, 166, 518), '每日任移']  # 每日任务
    KT_MZRW_OCR = [(42, 75, 166, 518), '每遇任移']  # 每周任务
    KT_MRSL_OCR = [(42, 75, 166, 518), '每日狩']  # 每日狩猎
    KT_CJ_OCR = [(42, 75, 166, 518), '成就']  # 成就
    HD_DR_OCR = [(1, 86, 210, 716), '登入']  # 登入挺励
    HD_XX_OCR = [(1, 86, 210, 716), '休息']  # 休息挺励

    # 邮件
    MAIL_UI_OCR = [(606, 39, 685, 82), '信件']  # 邮箱
    MAIL_SOLO_OCR = [(388, 133, 905, 166), '佃人']  # 个人
    # 组队
    TEAM_TAB = [(8, 291, 62, 343), Template(OT.imgpath('组队页签'))]
    TEAM_XZDW = [(86, 333, 215, 381), Template(OT.imgpath('寻找队伍'))]
    TEAM_ZDJR = [(89, 266, 212, 313), Template(OT.imgpath('自动加入'))]
    TEAM_ZDJR_QR = [(1110, 141, 1237, 190), Template(OT.imgpath('自动加入确认'))]
    TEAM_ZDJR_OCR = [(99, 282, 199, 305), '加入中']  # 自动加入中
    TEAM_CLDW = [(86, 197, 214, 248), Template(OT.imgpath('创立队伍'))]
    TEAM_CLDW_OCR = [(547, 39, 735, 82), '立']  # 创立队伍选项
    TEAM_PWD_OCR = [(540, 55, 741, 99), '密']  # 输入密码
    PD_BG = [(1069, 15, 1191, 70), Template(OT.imgpath('频道变更'))]
    PD_BG_OCR = [(574, 40, 710, 80), '更']
    PWD_TEAM = [(897, 189, 964, 533), Template(OT.imgpath('密码队伍'))]
    JION_TEAM_OCR = [(1007, 448, 1140, 473), '不存在']  # 不存在队伍

    EXIT_TEAM = [(290, 187, 328, 446), Template(OT.imgpath('离开队伍'))]
    QUIT_TEAM = [(540, 154, 738, 200), '伍']  # 进入每日时 离开队伍
    TKDK_OCR = [(42, 93, 129, 114), '天空的']


class UiEnumG:
    BAG_UI = [(59, 11, '415066'), (645, 32, '415066'), (557, 123, 'ffffff'),
              (467, 124, '2b3646'), (997, 675, '4c87b0'), (1148, 686, '4c87b0'), (59, 120, 'ee7546')]  # 背包主界面


class BatEnumG:
    TASK_ID = {
        '登录游戏': {'id': '0', 'state': 'Login'},
        '自动任务': {'id': '1', 'state': 'AutoTask'},
        '自动每日': {'id': '2', 'state': 'AutoMR'},
        '混Boss图': {'id': '5', 'state': 'AutoBoss'},
        '装备技能': {'id': '6', 'state': 'UseSkill'},
        '穿戴新手宠物': {'id': '7', 'state': 'UsePet'},
        '默认设置': {'id': '8', 'state': 'Login'},
        '开箱子': {'id': '9', 'state': 'Login'},
        '强化装备': {'id': '10', 'state': 'StrongEquip'},
        '升级装备': {'id': '11', 'state': 'UpEquip'},
        '自定义一': {'id': '11', 'state': 'Login'},
        '自定义二': {'id': '12', 'state': 'Login'},
    }
    MAP_DATA = {
        '1': {'NULL': []},
        '2': {'NULL': []},
        '3': {'研究所102': [[898, 1211, 159], [135], [135], [50, 0, 0], [1250, 1153, 966, 870]],
              '西边森林': [[928, 1213, 142], [1060, 135], [135], [80, 100, 50], [1250, 1153, 966, 870]],
              '冰冷死亡战场': [[928, 1213, 142], [1060, 135], [135], [50, 30, 100], [1250, 1153, 966, 870]],
              '龙蛋': [[1005, 1106, 148], [1020, 1073, 135], [1060, 135], [50, 100, 10], [1154, 1100, 1050, 970]],
              '爱奥斯塔入口': [[1000, 1088, 148], [956, 1139, 135], [1060, 1162, 135], [30, 70, 100], [1250, 1153, 966, 870]],
              '奥斯塔入口': [[1046, 148], [988, 135], [950, 135], [70, 100, 100], [1250, 1153, 966, 870]],
              '天空露台2': [[910, 989, 1096, 1229, 142], [135], [135], [30, 0, 0], [1250, 1153, 966, 870]],
              '机械室': [[902, 1084, 153], [1098, 135], [1114, 135], [50, 100, 100], [1250, 1153, 966, 870]],
              '时间漩涡': [[1015, 1084, 148], [1037, 1111, 135], [1060, 1078, 135], [50, 50, 100], [1250, 1153, 1000, 970]],
              '忘却之路4': [[1027, 1100, 153], [1151, 135], [1212, 135], [30, 70, 100], [1250, 1153, 966, 873]],
              '偏僻泥沼': [[949, 1050, 1212, 148], [921, 1156, 135], [1198, 135], [30, 70, 100], [1250, 1153, 966, 870]],
              '变形的森林': [[982, 1143, 153], [961, 1175, 135], [135], [50, 100, 0], [1250, 1153, 966, 870]],
              '武器库星图': [[933, 1094, 1216, 153], [998, 1060, 135], [135], [50, 50, 0], [1245, 1153, 966, 870]],
              '灰烬之风高原': [[1036, 1060, 153], [1024, 1060, 1119, 135], [135], [50, 50, 0], [1245, 1153, 966, 870]],
              '崎岖的峡谷': [[1022, 1067, 153], [949, 135], [1060, 1171, 135], [50, 100, 30], [1245, 1153, 966, 880]]

              },
        # ----野图
        '4': {
            '露台2': [[961, 1172, 142], [135], [135], [60, 0, 0], [1244, 1153, 966, 874]],
            '忘却之路3': [[975, 1171, 153], [135], [135], [70, 0, 0], [1245, 1153, 966, 870]],
            '神秘森林': [[911, 1193, 135], [904, 1178, 135], [135], [70, 100, 0], [1244, 1153, 966, 874]],
            '骑士之殿': '3',
            '武器库': [[933, 1060, 1172, 153], [1001, 1123, 135], [135], [50, 50, 0], [1245, 1153, 966, 870]],
            '崎岖峡谷': [[1023, 1066, 153], [950, 1060, 135], [135], [60, 100, 0], [1245, 1153, 966, 870]],
            '木菇菇林': [[1027, 1112, 153], [135], [135], [30, 0, 0], [1165, 1085, 1050, 960]]
        }

    }
    # 0:识别左上角地图名,1:星图星数
    MAP_OCR = {
        'NULL': [[0, ''], 0],
        '研究所102': [[(42, 103, 156, 123), '研究所'], 40],
        '西边森林': [[(41, 102, 163, 122), '神木村'], 45],
        '冰冷死亡战场': [[(40, 104, 146, 122), '死亡'], 65],
        '龙蛋': [[(42, 87, 114, 104), '80'], 80],
        '爱奥斯塔入口': [[(43, 101, 149, 124), '塔入口'], 90],
        '奥斯塔入口': [[(40, 102, 159, 122), '赫'], 105],
        '天空露台2': [[(40, 87, 114, 104), '110'], 110],
        '机械室': [[(40, 92, 182, 114), '113'], 113],
        '时间漩涡': [[(40, 90, 184, 117), '115'], 115],
        '忘却之路4': [[(40, 93, 192, 116), '之路'], 120],
        '偏僻泥沼': [[(40, 93, 178, 113), '泥沼'], 130],
        '变形的森林': [[(40, 102, 161, 121), '森林'], 136],
        '武器库星图': [[(40, 93, 168, 116), '142'], 142],
        '灰烬之风高原': [[(39, 85, 118, 106), '144'], 144],
        '崎岖的峡谷': [[(39, 90, 192, 118), '147'], 147],
        # ----野图
        '神秘森林': [[(43, 91, 169, 115), '神秘森林'], '森林', '神秘森林', 80],
        '露台2': [[(40, 90, 148, 117), '2'], '斯湖', '2', 110],
        '忘却之路3': [[(42, 92, 131, 117), '之路3'], '神殿', '之路3', 120],
        '武器库': [[(41, 92, 98, 116), '武器'], '未来', '武器', 139],
        '崎岖峡谷': [[(42, 93, 129, 114), '的峡谷'], '未来', '的峡谷', 144],
        '木菇菇林': [[(40, 90, 174, 120), '木菇'], '艾', '木菇', 150]
    }
    # 米纳雨森林
    # 路德斯湖
    # 艾霰森林
    # 诗固神殿
    # 武陵桃圆
    # 未来之門
    # 瑞恩村
